Основные_объекты_КР/src/Documents/ЗаявкаНаТранспорт/ЗаявкаНаТранспорт.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗаявкаНаТранспорт</name>
  <basedOn>Document.РасходнаяНакладная</basedOn>
  <registerRecords>InformationRegister.МестоположенияБригад</registerRecords>
  <attributes>
    <name>Покупатель</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтактноеЛицо</name>
    <type>
      <types>CatalogRef.КонтактныеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.РасходнаяНакладная</types>
    </type>
  </attributes>
  <attributes>
    <name>Машина</name>
    <type>
      <types>CatalogRef.ТранспортныеСредства</types>
    </type>
  </attributes>
  <attributes>
    <name>Водитель</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>ПервыйГрузчик</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>ВторойГрузчик</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекущийЭтапДоставки</name>
    <type>
      <types>EnumRef.ЭтапыДоставки</types>
    </type>
  </attributes>
  <attributes>
    <name>Километраж</name>
    <comment>Расстояние в км. туда и обратно</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Примечание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
</mdclass:Document>

Основные_объекты_КР/src/InformationRegisters/МестоположенияБригад/МестоположенияБригад.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>МестоположенияБригад</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ЭтапДоставки</name>
    <type>
      <types>EnumRef.ЭтапыДоставки</types>
    </type>
  </resources>
  <dimensions>
    <name>Машина</name>
    <type>
      <types>CatalogRef.ТранспортныеСредства</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Основные_объекты_КР/src/Enums/ЭтапыДоставки/ЭтапыДоставки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ЭтапыДоставки</name>
  <enumValues>
    <name>ДоставкаНеНачата</name>
  </enumValues>
  <enumValues>
    <name>ВДорогеКПокупателю</name>
  </enumValues>
  <enumValues>
    <name>УПокупателя</name>
  </enumValues>
  <enumValues>
    <name>ВДорогеНаСклад</name>
  </enumValues>
  <enumValues>
    <name>ДоставкаВыполнена</name>
  </enumValues>
</mdclass:Enum>

Основные_объекты_КР/src/Documents/ЗаявкаНаТранспорт/ObjectModule.bsl
Процедура ОбработкаЗаполнения(Основание)
	
	Если ТипЗнч(Основание) = Тип("ДокументСсылка.РасходнаяНакладная") Тогда
		// Проверка: не введено ли уже какой-нибудь заявки
		//           на основании этой расходной накладной
		
		Запрос = Новый Запрос;
		Запрос.Текст = "
		|ВЫБРАТЬ
		|	Ссылка КАК ОформленнаяЗаявка
		|ИЗ
		|	Документ.ЗаявкаНаТранспорт
		|ГДЕ
		|	ДокументОснование = &ТекущийДокументОснование
		|";
		
		Запрос.УстановитьПараметр("ТекущийДокументОснование", Основание);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Если РезультатЗапроса.Пустой() = Истина Тогда
			
			ОформленнаяЗаявка = РезультатЗапроса.Выгрузить().Получить(0).ОформленнаяЗаявка;
			
			Сообщить("На основании '" + Основание + "' уже оформлена заявка:" + Символы.ПС +
					 "   - '" + ОформленнаяЗаявка + "'");
			
		Иначе
			
			ДокументОснование = Основание;
			
			Покупатель = Основание.Контрагент;
			КонтактноеЛицо = Основание.КонтактноеЛицо;
			ТекущийЭтапДоставки = Перечисления.ЭтапыДоставки.ДоставкаНеНачата;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если ЗначениеЗаполнено(Ссылка) = Ложь Тогда
		// Проверка заполнения данных менеджера
		
		ПроверяемыеРеквизиты.Добавить("Покупатель");
		ПроверяемыеРеквизиты.Добавить("КонтактноеЛицо");
	
	Иначе
		// Проверка заполнения данных сотрудника транспортного отдела
	
		ПроверяемыеРеквизиты.Добавить("Машина");
		ПроверяемыеРеквизиты.Добавить("Водитель");
		ПроверяемыеРеквизиты.Добавить("ПервыйГрузчик");
		ПроверяемыеРеквизиты.Добавить("ВторойГрузчик");
		ПроверяемыеРеквизиты.Добавить("ТекущийЭтапДоставки");
		ПроверяемыеРеквизиты.Добавить("Километраж");
	
	КонецЕсли;

КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)

	Если ТекущийЭтапДоставки = Перечисления.ЭтапыДоставки.ДоставкаНеНачата Тогда
		
		Запрос = Новый Запрос;
		
		Запрос.Текст = "
		|ВЫБРАТЬ
		|	Регистратор КАК ПредыдущаяЗаявка,
		|	ЭтапДоставки КАК ЭтапДоставкиВПредыдущейЗаявке
		|ИЗ
		|	РегистрСведений.МестоположенияБригад.СрезПоследних(&МоментВремени, Машина = &ВыбраннаяМашина)
		|";

		Запрос.УстановитьПараметр("МоментВремени", МоментВремени());
		Запрос.УстановитьПараметр("ВыбраннаяМашина", Машина);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Если РезультатЗапроса.Пустой() = Ложь Тогда
			
			ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
			
			ВыборкаДетальныеЗаписи.Следующий();
			
			Если ВыборкаДетальныеЗаписи.ЭтапДоставкиВПредыдущейЗаявке <> Перечисления.ЭтапыДоставки.ДоставкаВыполнена Тогда
				
				Сообщить("Предыдущая доставка на машине '" + Машина + "' еще не завершена:" + Символы.ПС +
						 "   - Документ: '" + ВыборкаДетальныеЗаписи.ПредыдущаяЗаявка + "':" + Символы.ПС +
						 "      - Этап доставки: " + ВыборкаДетальныеЗаписи.ЭтапДоставкиВПредыдущейЗаявке);
				Отказ = Истина;
				Возврат;
				
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	// Формирование записей в регистре сведений 'МестоположенияБригад'
	Движение = Движения.МестоположенияБригад.Добавить();
	Движение.Период = Дата;
	
	Движение.Машина = Машина;
	Движение.ЭтапДоставки = ТекущийЭтапДоставки;
	
КонецПроцедуры
